In [50]:
import pandas as pd

In [51]:
people={
    "first":['jon','cersei','arya'],
    "last":["snow","lannister",'stark'],
    "place":['winterfell','kings landing','bravos']
}

In [52]:
df=pd.DataFrame(people)

    first       last          place
0     jon       snow     winterfell
1  cersei  lannister  kings landing
2    arya      stark         bravos

In [54]:
df['place']

0       winterfell
1    kings landing
2           bravos
Name: place, dtype: object

In [55]:
df[['first','last']]

    first       last
0     jon       snow
1  cersei  lannister
2    arya      stark

In [56]:
df.place

0       winterfell
1    kings landing
2           bravos
Name: place, dtype: object

In [57]:
df.columns

Index(['first', 'last', 'place'], dtype='object')

In [58]:
df.iloc[2]

first      arya
last      stark
place    bravos
Name: 2, dtype: object

In [59]:
df.iloc[[0,1,2]]

    first       last          place
0     jon       snow     winterfell
1  cersei  lannister  kings landing
2    arya      stark         bravos

In [60]:
df.iloc[[0,1],2]

0       winterfell
1    kings landing
Name: place, dtype: object

In [61]:
df.loc[2]

first      arya
last      stark
place    bravos
Name: 2, dtype: object

In [62]:
df.loc[[0,1]]

    first       last          place
0     jon       snow     winterfell
1  cersei  lannister  kings landing

In [63]:
df.loc[[0,1],'first']

0       jon
1    cersei
Name: first, dtype: object

In [64]:
df.loc[[0,1],['first','last']]

    first       last
0     jon       snow
1  cersei  lannister

In [65]:
df.loc[[0,1,2],'first']

0       jon
1    cersei
2      arya
Name: first, dtype: object

In [66]:
df.loc[0:2,'first':'place']

    first       last          place
0     jon       snow     winterfell
1  cersei  lannister  kings landing
2    arya      stark         bravos